{"class_name": "Sequential", "keras_version": "2.1.6", "backend": "tensorflow", "config": [{"class_name": "Merge", "config": {"mode_type": "raw", "name": "merge_1", "arguments": {}, "output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "output_shape_type": "raw", "mode": "concat", "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"output_dim": 300, "trainable": false, "batch_input_shape": [null, 519], "embeddings_regularizer": null, "input_dim": 8586, "input_length": 519, "name": "embedding_1", "dtype": "float32", "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_constraint": null, "mask_zero": false, "activity_regularizer": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"output_dim": 300, "trainable": true, "batch_input_shape": [null, 519], "embeddings_regularizer": null, "input_dim": 8586, "input_length": 519, "name": "embedding_2", "dtype": "float32", "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_constraint": null, "mask_zero": false, "activity_regularizer": null}}]}], "dot_axes": -1, "output_mask": null}}, {"class_name": "Conv1D", "config": {"activation": "relu", "use_bias": true, "trainable": true, "kernel_constraint": null, "strides": [1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "name": "conv1d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_size": [5], "padding": "valid", "dilation_rate": [1], "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_1", "pool_size": [515], "strides": [515], "trainable": true, "padding": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "relu", "use_bias": true, "trainable": true, "kernel_constraint": null, "name": "dense_1", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "seed": null, "rate": 0.5, "trainable": true, "noise_shape": null}}, {"class_name": "Dense", "config": {"activation": "softmax", "use_bias": true, "trainable": true, "kernel_constraint": null, "name": "dense_2", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null}}]}