{"class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"name": "merge_1", "output_mask_type": "raw", "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"activity_regularizer": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "dtype": "float32", "output_dim": 300, "mask_zero": false, "embeddings_regularizer": null, "name": "embedding_1", "embeddings_constraint": null, "input_length": 520, "trainable": false, "input_dim": 21679, "batch_input_shape": [null, 520]}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"activity_regularizer": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "dtype": "float32", "output_dim": 300, "mask_zero": false, "embeddings_regularizer": null, "name": "embedding_2", "embeddings_constraint": null, "input_length": 520, "trainable": true, "input_dim": 21679, "batch_input_shape": [null, 520]}}]}], "dot_axes": -1, "output_mask": null, "output_shape_type": "raw", "mode_type": "raw", "arguments": {}, "mode": "concat", "concat_axis": -1, "output_shape": null}}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "activation": "relu", "padding": "valid", "activity_regularizer": null, "filters": 64, "kernel_regularizer": null, "name": "conv1d_1", "kernel_size": [5], "trainable": true, "dilation_rate": [1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "name": "max_pooling1d_1", "pool_size": [516], "strides": [516], "trainable": true}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"units": 256, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "name": "dense_1", "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_1", "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "Dense", "config": {"units": 45, "kernel_constraint": null, "activity_regularizer": null, "activation": "softmax", "kernel_regularizer": null, "name": "dense_2", "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}], "backend": "tensorflow", "keras_version": "2.1.6"}