{"class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"name": "merge_1", "mode_type": "raw", "concat_axis": -1, "output_mask": null, "output_shape_type": "raw", "output_shape": null, "dot_axes": -1, "output_mask_type": "raw", "mode": "concat", "arguments": {}, "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_1", "mask_zero": false, "trainable": false, "activity_regularizer": null, "dtype": "float32", "batch_input_shape": [null, 519], "embeddings_regularizer": null, "input_dim": 5267, "embeddings_constraint": null, "output_dim": 300, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "input_length": 519}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_2", "mask_zero": false, "trainable": true, "activity_regularizer": null, "dtype": "float32", "batch_input_shape": [null, 519], "embeddings_regularizer": null, "input_dim": 5267, "embeddings_constraint": null, "output_dim": 300, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "input_length": 519}}]}]}}, {"class_name": "Conv1D", "config": {"name": "conv1d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "strides": [1], "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1], "filters": 64, "bias_constraint": null, "padding": "valid", "bias_regularizer": null, "kernel_size": [5]}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_1", "strides": [515], "trainable": true, "padding": "valid", "pool_size": [515]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "units": 256, "kernel_regularizer": null, "use_bias": true, "activation": "relu", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "noise_shape": null, "trainable": true, "rate": 0.5, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "units": 5, "kernel_regularizer": null, "use_bias": true, "activation": "softmax", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null}}], "backend": "tensorflow", "keras_version": "2.1.6"}