{"config": [{"config": {"mode_type": "raw", "output_shape": null, "arguments": {}, "mode": "concat", "concat_axis": -1, "output_shape_type": "raw", "output_mask": null, "layers": [{"config": [{"config": {"mask_zero": false, "trainable": false, "input_dim": 88163, "input_length": 27542, "batch_input_shape": [null, 27542], "activity_regularizer": null, "embeddings_constraint": null, "embeddings_regularizer": null, "dtype": "float32", "output_dim": 300, "name": "embedding_1", "embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"mask_zero": false, "trainable": true, "input_dim": 88163, "input_length": 27542, "batch_input_shape": [null, 27542], "activity_regularizer": null, "embeddings_constraint": null, "embeddings_regularizer": null, "dtype": "float32", "output_dim": 300, "name": "embedding_2", "embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}}, "class_name": "Embedding"}], "class_name": "Sequential"}], "dot_axes": -1, "name": "merge_1", "output_mask_type": "raw"}, "class_name": "Merge"}, {"config": {"strides": [1], "trainable": true, "kernel_regularizer": null, "use_bias": true, "filters": 64, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "dilation_rate": [1], "name": "conv1d_1", "kernel_size": [5]}, "class_name": "Conv1D"}, {"config": {"strides": [27538], "trainable": true, "pool_size": [27538], "name": "max_pooling1d_1", "padding": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_constraint": null, "name": "dense_1", "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "units": 256}, "class_name": "Dense"}, {"config": {"rate": 0.5, "trainable": true, "name": "dropout_1", "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_constraint": null, "name": "dense_2", "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "units": 100}, "class_name": "Dense"}], "keras_version": "2.1.6", "class_name": "Sequential", "backend": "tensorflow"}