{"class_name": "Sequential", "keras_version": "2.1.6", "config": [{"class_name": "Merge", "config": {"name": "merge_1", "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_1", "mask_zero": false, "output_dim": 300, "trainable": false, "dtype": "float32", "embeddings_constraint": null, "embeddings_regularizer": null, "input_length": 27542, "input_dim": 40116, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "batch_input_shape": [null, 27542], "activity_regularizer": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_2", "mask_zero": false, "output_dim": 300, "trainable": true, "dtype": "float32", "embeddings_constraint": null, "embeddings_regularizer": null, "input_length": 27542, "input_dim": 40116, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "batch_input_shape": [null, 27542], "activity_regularizer": null}}]}], "dot_axes": -1, "mode": "concat", "output_shape": null, "concat_axis": -1, "output_mask_type": "raw", "arguments": {}, "output_shape_type": "raw", "mode_type": "raw", "output_mask": null}}, {"class_name": "Conv1D", "config": {"name": "conv1d_1", "bias_constraint": null, "padding": "valid", "dilation_rate": [1], "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "strides": [1], "filters": 64, "activation": "relu", "trainable": true, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_1", "strides": [27538], "pool_size": [27538], "trainable": true, "padding": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "units": 256, "activation": "relu", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.5, "noise_shape": null, "trainable": true, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "units": 10, "activation": "softmax", "use_bias": true, "bias_regularizer": null, "activity_regularizer": null}}], "backend": "tensorflow"}