{"config": [{"config": {"dot_axes": -1, "arguments": {}, "output_shape": null, "concat_axis": -1, "output_shape_type": "raw", "output_mask": null, "layers": [{"config": [{"config": {"input_length": 12998, "batch_input_shape": [null, 12998], "mask_zero": false, "dtype": "float32", "activity_regularizer": null, "embeddings_constraint": null, "trainable": false, "embeddings_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}, "embeddings_regularizer": null, "output_dim": 300, "name": "embedding_1", "input_dim": 31104}, "class_name": "Embedding"}], "class_name": "Sequential"}, {"config": [{"config": {"input_length": 12998, "batch_input_shape": [null, 12998], "mask_zero": false, "dtype": "float32", "activity_regularizer": null, "embeddings_constraint": null, "trainable": true, "embeddings_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}, "embeddings_regularizer": null, "output_dim": 300, "name": "embedding_2", "input_dim": 31104}, "class_name": "Embedding"}], "class_name": "Sequential"}], "mode": "concat", "name": "merge_1", "mode_type": "raw", "output_mask_type": "raw"}, "class_name": "Merge"}, {"config": {"kernel_constraint": null, "kernel_size": [5], "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_constraint": null, "name": "conv1d_1", "trainable": true, "bias_regularizer": null, "padding": "valid", "kernel_regularizer": null, "dilation_rate": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 64, "strides": [1]}, "class_name": "Conv1D"}, {"config": {"name": "max_pooling1d_1", "trainable": true, "pool_size": [12994], "padding": "valid", "strides": [12994]}, "class_name": "MaxPooling1D"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_constraint": null, "name": "dense_1", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 256, "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"noise_shape": null, "trainable": true, "name": "dropout_1", "rate": 0.5, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "activation": "softmax", "bias_constraint": null, "name": "dense_2", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 5, "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.6"}